kaaproject/kaa/client/client-multi/client-c/src/kaa/platform-impl/stm32/leafMapleMini/esp8266/esp8266_kaa_tcp_channel.c
/**
 *  Copyright 2014-2016 CyberVision, Inc.
 *
 *  Licensed under the Apache License, Version 2.0 (the "License");
 *  you may not use this file except in compliance with the License.
 *  You may obtain a copy of the License at
 *
 *       http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS,
 *  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 */

typedef unsigned char uint8;
typedef unsigned int uint32;

#include <stdbool.h>
#include <stdint.h>
#include <stddef.h>
#include <string.h>
#include <stdio.h>
#include <time.h>
#include <stdarg.h>

#include "../../../../kaa_common.h"
#include "../../../../utilities/kaa_buffer.h"
#include "../../../../utilities/kaa_log.h"
#include "../../../../utilities/kaa_mem.h"
#include "../../../../kaa_protocols/kaa_tcp/kaatcp.h"
#include "../../../../kaa_platform_common.h"
#include "../../../../platform/sock.h"
#include "../leaf_time.h"
#include "esp8266_kaa_tcp_channel.h"



#define KAA_TCP_CHANNEL_TRANSPORT_PROTOCOL_ID         0x56c8ff92
#define KAA_TCP_CHANNEL_TRANSPORT_PROTOCOL_VERSION    1




typedef enum {
    AP_UNDEFINED = 0,
    AP_NOT_SET,
    AP_SET,
    AP_CONNECTED,
    AP_DISCONNECTED
} access_point_state_t;

typedef enum {
    KAA_TCP_CHANNEL_UNDEFINED = 0,
    KAA_TCP_CHANNEL_AUTHORIZING,
    KAA_TCP_CHANNEL_AUTHORIZED,
    KAA_TCP_CHANNEL_DISCONNECTING
} kaa_tcp_channel_state_t;

typedef enum {
    KAA_TCP_CHANNEL_SYNC_OP_UNDEFINED = 0,
    KAA_TCP_CHANNEL_SYNC_OP_STARTED,
    KAA_TCP_CHANNEL_SYNC_OP_FINISHED
} kaa_tcp_channel_sync_state_t;

typedef struct {
    access_point_state_t      state;
    uint32_t                  id;
    char                      *public_key;
    uint32_t                  public_key_length;
    char                      *hostname;
    uint32_t                  hostname_length;
    uint16_t                  port;
} kaa_tcp_access_point_t;

typedef struct {
    uint16_t      keepalive_interval;
    kaa_time_t    last_sent_keepalive;
    kaa_time_t    last_receive_keepalive;
} kaa_tcp_keepalive_t ;

typedef struct {
    char      *aes_session_key;
    size_t    aes_session_key_size;
    char      *signature;
    size_t    signature_size;
} kaa_tcp_encrypt_t;

typedef struct {
    kaa_logger_t                   *logger;
    kaa_tcp_channel_state_t        channel_state;
    kaa_tcp_channel_sync_state_t   sync_state;
    kaa_server_type_t              channel_operation_type;
    kaa_transport_protocol_id_t    protocol_id;
    kaa_transport_context_t        transport_context;
    void                           *event_context;
    kaa_tcp_access_point_t         access_point;
    kaa_extension_id               *pending_request_services;
    size_t                         pending_request_service_count;
    kaa_extension_id               *supported_services;
    size_t                         supported_service_count;
    kaa_buffer_t                   *out_buffer;
    kaatcp_parser_t                *parser;
    uint16_t                       message_id;
    kaa_tcp_keepalive_t            keepalive;
    kaa_tcp_encrypt_t              encryption;
} kaa_tcp_channel_t;



static kaa_error_t kaa_tcp_channel_get_transport_protocol_info(void *context, kaa_transport_protocol_id_t *protocol_info);
static kaa_error_t kaa_tcp_channel_get_supported_services(void *context, kaa_extension_id **supported_services, size_t *service_count);
static kaa_error_t kaa_tcp_channel_sync_handler(void *context, const kaa_extension_id services[], size_t service_count);
static kaa_error_t kaa_tcp_channel_destroy_context(void *context);
static kaa_error_t kaa_tcp_channel_init(void *context, kaa_transport_context_t *transport_context);
static kaa_error_t kaa_tcp_channel_set_access_point(void *context, kaa_access_point_t *access_point);

/*
 * Parser handlers
 */
static void kaa_tcp_channel_connack_message_callback(void *context, kaatcp_connack_t message);
static void kaa_tcp_channel_disconnect_message_callback(void *context, kaatcp_disconnect_t message);
static void kaa_tcp_channel_kaasync_message_callback(void *context, kaatcp_kaasync_t *message);
static void kaa_tcp_channel_pingresp_message_callback(void *context);

/*
 * Internal functions
 */
static kaa_error_t kaa_tcp_channel_on_access_point_failed(kaa_tcp_channel_t *self);
static kaa_error_t kaa_tcp_channel_socket_io_error(kaa_tcp_channel_t *self);
static kaa_error_t kaa_tcp_channel_authorize(kaa_tcp_channel_t *self);
static bool is_service_pending(kaa_tcp_channel_t *self, const kaa_extension_id service);
static kaa_error_t kaa_tcp_channel_delete_pending_services(kaa_tcp_channel_t *self, const kaa_extension_id services[], size_t service_count);
static kaa_error_t kaa_tcp_channel_update_pending_services(kaa_tcp_channel_t *self, const kaa_extension_id services[], size_t service_count);
static inline uint32_t get_uint32_t(const char *buffer);
static kaa_error_t kaa_tcp_channel_release_access_point(kaa_tcp_channel_t *self);
static kaa_error_t kaa_tcp_channel_write_pending_services(kaa_tcp_channel_t *self, kaa_extension_id *service, size_t services_count);
static char* kaa_tcp_write_pending_services_allocator_fn(void *context, size_t buffer_size);
static kaa_error_t kaa_tcp_channel_ping(kaa_tcp_channel_t *self);
static kaa_error_t kaa_tcp_channel_disconnect_internal(kaa_tcp_channel_t *self, kaatcp_disconnect_reason_t return_code);


kaa_error_t kaa_tcp_channel_get_access_point(kaa_transport_channel_interface_t *self, char **hostname, size_t *hostname_size, uint16_t *port);
kaa_error_t kaa_tcp_channel_disconnected(kaa_transport_channel_interface_t *self);
kaa_error_t kaa_tcp_channel_connected(kaa_transport_channel_interface_t *self);

kaa_error_t kaa_tcp_channel_get_buffer_for_send(kaa_transport_channel_interface_t *self, uint8 **buffer, size_t *buffer_size);
kaa_error_t kaa_tcp_channel_free_send_buffer(kaa_transport_channel_interface_t *self, size_t bytes_written);
kaa_error_t kaa_tcp_channel_read_bytes(kaa_transport_channel_interface_t *self, const uint8 *buffer, const size_t buffer_size);

bool kaa_tcp_channel_connection_is_ready_to_terminate(kaa_transport_channel_interface_t *self);

