kaaproject/kaa/client/client-multi/client-c/src/kaa/platform-impl/stm32/leafMapleMini/esp8266/esp8266_kaa_tcp_channel.c
    kaatcp_error_code = kaatcp_get_request_disconnect(&disconnect_message, buffer, &buffer_size);

    if (kaatcp_error_code) {
        KAA_LOG_ERROR(self->logger, KAA_ERR_TCPCHANNEL_PARSER_ERROR, "Kaa TCP channel [0x%08X] failed to serialize DISCONNECT message"
                                                                                                                , self->access_point.id);
        return KAA_ERR_TCPCHANNEL_PARSER_ERROR;
    }

    error_code = kaa_buffer_lock_space(self->out_buffer, buffer_size);

    self->channel_state = KAA_TCP_CHANNEL_DISCONNECTING;

    KAA_LOG_INFO(self->logger,KAA_ERR_NONE,"Kaa TCP channel [0x%08X] going to send DISCONNECT message (%zu bytes)"
                                                                                , self->access_point.id, buffer_size);

    return error_code;
}

/**
 * esp8266 kaa_tcp_channel specific API
 *
 */

kaa_error_t kaa_tcp_channel_get_access_point(kaa_transport_channel_interface_t *self,
                                            char **hostname, size_t *hostname_size, uint16_t *port)
{
    KAA_RETURN_IF_NIL5(self, self->context, hostname, hostname_size, port, KAA_ERR_BADPARAM);

    *hostname = NULL;
    *hostname_size = 0;
    *port = 0;

    if (((kaa_tcp_channel_t *)(self->context))->access_point.state == AP_SET) {
        *hostname = ((kaa_tcp_channel_t *)(self->context))->access_point.hostname;
        *hostname_size = ((kaa_tcp_channel_t *)(self->context))->access_point.hostname_length;
        *port = ((kaa_tcp_channel_t *)(self->context))->access_point.port;
    }

    return KAA_ERR_NONE;
}

kaa_error_t kaa_tcp_channel_disconnected(kaa_transport_channel_interface_t *self)
{
    KAA_RETURN_IF_NIL2(self, self->context, KAA_ERR_BADPARAM);

    return kaa_tcp_channel_socket_io_error((kaa_tcp_channel_t *)self->context);
}

kaa_error_t kaa_tcp_channel_connected(kaa_transport_channel_interface_t *self)
{
    KAA_RETURN_IF_NIL2(self, self->context, KAA_ERR_BADPARAM);

    kaa_tcp_channel_t *tcp_channel = (kaa_tcp_channel_t *)self->context;

    kaa_error_t error_code = KAA_ERR_NONE;
    tcp_channel->access_point.state = AP_CONNECTED;

    error_code = kaa_tcp_channel_authorize(tcp_channel);

    return error_code;
}


kaa_error_t kaa_tcp_channel_get_buffer_for_send(kaa_transport_channel_interface_t *self
                                 , uint8 **buffer, size_t *buffer_size)
{
    KAA_RETURN_IF_NIL4(self, self->context, buffer, buffer_size, KAA_ERR_BADPARAM);

    kaa_tcp_channel_t *tcp_channel = (kaa_tcp_channel_t *)self->context;

    kaa_error_t error_code = KAA_ERR_NONE;

    if (tcp_channel->pending_request_service_count > 0) {
        if (tcp_channel->channel_operation_type == KAA_SERVER_BOOTSTRAP) {
            kaa_extension_id boostrap_service[] = {KAA_EXTENSION_BOOTSTRAP};
            KAA_LOG_TRACE(tcp_channel->logger, KAA_ERR_NONE, "Kaa TCP channel [0x%08X] going to sync Bootstrap service"
                                                                                         , tcp_channel->access_point.id);
            error_code = kaa_tcp_channel_write_pending_services(tcp_channel, boostrap_service, 1);
        } else if (tcp_channel->channel_state == KAA_TCP_CHANNEL_AUTHORIZED) {
            KAA_LOG_TRACE(tcp_channel->logger, KAA_ERR_NONE, "Kaa TCP channel [0x%08X] going to sync all services"
                                                                                    , tcp_channel->access_point.id);
            error_code = kaa_tcp_channel_write_pending_services(tcp_channel
                                                              , tcp_channel->pending_request_services
                                                              , tcp_channel->pending_request_service_count);
        } else if (tcp_channel->access_point.state == AP_CONNECTED
                && tcp_channel->channel_state != KAA_TCP_CHANNEL_AUTHORIZING
                && tcp_channel->channel_state != KAA_TCP_CHANNEL_AUTHORIZED){
            KAA_LOG_TRACE(tcp_channel->logger, KAA_ERR_NONE, "Kaa TCP channel [0x%08X] authorizing channel"
                                                                            , tcp_channel->access_point.id);
            error_code = kaa_tcp_channel_authorize(tcp_channel);
        }
    }

    error_code = kaa_buffer_get_unprocessed_space(tcp_channel->out_buffer, (char **)buffer, buffer_size);

    return error_code;
}


kaa_error_t kaa_tcp_channel_free_send_buffer(kaa_transport_channel_interface_t *self, size_t bytes_written)
{
    KAA_RETURN_IF_NIL3(self, self->context, bytes_written, KAA_ERR_BADPARAM);

    kaa_error_t error_code = KAA_ERR_NONE;
    error_code = kaa_buffer_free_allocated_space(((kaa_tcp_channel_t *)(self->context))->out_buffer, bytes_written);
    return error_code;
}

kaa_error_t kaa_tcp_channel_read_bytes(kaa_transport_channel_interface_t *self, const uint8 *buffer, const size_t buffer_size)
{
    KAA_RETURN_IF_NIL4(self, self->context, buffer, buffer_size, KAA_ERR_BADPARAM);

    kaa_tcp_channel_t *tcp_channel = (kaa_tcp_channel_t *)self->context;

    kaa_error_t error_code = KAA_ERR_NONE;

    //TODO Modify parser errors code
    kaatcp_error_t kaatcp_error_code = kaatcp_parser_process_buffer(tcp_channel->parser, buffer, buffer_size);
    if (kaatcp_error_code) {
        KAA_LOG_ERROR(tcp_channel->logger, KAA_ERR_TCPCHANNEL_PARSER_ERROR,
                "Error parsing incomming bytes, parser error code %d", kaatcp_error_code);
        error_code = KAA_ERR_TCPCHANNEL_PARSER_ERROR;
    }


    return error_code;
}

bool kaa_tcp_channel_connection_is_ready_to_terminate(kaa_transport_channel_interface_t *self)
{
    KAA_RETURN_IF_NIL2(self, self->context, false);

    if (((kaa_tcp_channel_t *)(self->context))->channel_state == KAA_TCP_CHANNEL_DISCONNECTING) {
//        KAA_LOG_TRACE(((kaa_tcp_channel_t *)(self->context))->logger, KAA_ERR_NONE
//                                                        , "Kaa TCP channel [0x%08X] disconnecting..."
//                                                        , ((kaa_tcp_channel_t *)(self->context))->access_point.id);
        //Check if buffer is empty, close socket.
        char *buf = NULL;
        size_t buf_size = 0;
        kaa_error_t error_code = kaa_buffer_get_unprocessed_space(((kaa_tcp_channel_t *)(self->context))->out_buffer, &buf, &buf_size);
        if (error_code || buf_size) {
//            KAA_LOG_TRACE(((kaa_tcp_channel_t *)(self->context))->logger, error_code
//                , "Kaa TCP channel [0x%08X] out buffer not empty %d bytes remains to transmit, continue disconnecting..."
//                , ((kaa_tcp_channel_t *)(self->context))->access_point.id, buf_size);
            return false;
        } else {
            return true;
        }
    }
    return false;
}
